In [1]:
import numpy as np
import pandas as pd

In [2]:
basics = pd.read_csv('data/title_basics.csv.gz')

In [3]:
## create a col with a list of genres
basics["genres_split"] = basics["genres"].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
81619,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
81620,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81621,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
81622,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81623,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [4]:
#Exploding the series and taking the unique values
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
81622,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
81622,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
81622,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
81623,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
81623,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [5]:
#Taking unique genres only
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [6]:
#saving tconst and genres_split as new df
title_genres = exploded_genres[["tconst","genres_split"]].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [7]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [8]:
## make new integer genre_id and drop string genres
title_genres["genre_id"] = title_genres["genres_split"].map(genre_map)
title_genres = title_genres.drop(columns = "genres_split")

In [9]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

# SQLAlchemy

In [10]:
import pymysql
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists
pymysql.install_as_MySQLdb()
username = "root"
password = "root"
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
    
    
if database_exists(connection):
    print("already exist")
    
else: create_database(connection)

already exist

In [11]:
engine = create_engine(connection)

# Basics

In [12]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81624 entries, 0 to 81623
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81624 non-null  object
 1   titleType       81624 non-null  object
 2   primaryTitle    81624 non-null  object
 3   originalTitle   81624 non-null  object
 4   isAdult         81624 non-null  int64
 5   startYear       81624 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81624 non-null  int64
 8   genres          81624 non-null  object
 9   genres_split    81624 non-null  object
dtypes: float64(2), int64(2), object(6)
memory usage: 6.2+ MB

In [13]:
basics = basics.drop(columns = ["endYear", "titleType", "originalTitle", "isAdult", "genres", "genres_split"])

In [14]:
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_basics = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [15]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_basics, if_exists='replace',index=False)

engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [16]:
f = """SELECT b.tconst, b.primaryTitle, b.startYear, b.runtimeMinutes
FROM title_basics as b
LIMIT 5"""
pd.read_sql(f,engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

# Title Ratings

In [17]:
title_ratings = pd.read_csv("Data/title_ratings.csv.gz")

In [18]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 496664 entries, 0 to 496663
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         496664 non-null  object
 1   averageRating  496664 non-null  float64
 2   numVotes       496664 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.4+ MB

In [19]:
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_title_ratings = {
    "tconst": String(key_len+1), 
    "averageRating":Float(),
    "numVotes":Integer()}

In [20]:
# Save to sql with dtype and index=False
title_ratings.to_sql('title_ratings',engine,dtype=df_title_ratings, if_exists='replace',index=False)

engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [21]:
g = """SELECT r.tconst, r.averageRating, r.numVotes
FROM title_ratings as r
LIMIT 5"""
pd.read_sql(g,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1965
1  tt0000002            5.8       263
2  tt0000005            6.2      2607
3  tt0000006            5.2       181
4  tt0000007            5.4       816

# The TMDB API Results

In [22]:
tmdb_data = pd.read_csv("Data/tmdb_results_combined.csv.gz")
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2571 entries, 0 to 2570
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2571 non-null   object
 1   adult                  2569 non-null   float64
 2   backdrop_path          1404 non-null   object
 3   belongs_to_collection  209 non-null    object
 4   budget                 2569 non-null   float64
 5   genres                 2569 non-null   object
 6   homepage               170 non-null    object
 7   id                     2569 non-null   float64
 8   original_language      2569 non-null   object
 9   original_title         2569 non-null   object
 10  overview               2521 non-null   object
 11  popularity             2569 non-null   float64
 12  poster_path            2315 non-null   object
 13  production_companies   2569 non-null   object
 14  production_countries   2569 non-null   object
 15  release_date           2546 non-null   object
 16  revenue                2569 non-null   float64
 17  runtime                2569 non-null   float64
 18  spoken_languages       2569 non-null   object
 19  status                 2569 non-null   object
 20  tagline                1109 non-null   object
 21  title                  2569 non-null   object
 22  video                  2569 non-null   float64
 23  vote_average           2569 non-null   float64
 24  vote_count             2569 non-null   float64
 25  certification          816 non-null    object
dtypes: float64(9), object(17)
memory usage: 522.4+ KB

In [23]:
tmdb_data = tmdb_data.drop(columns = ["adult", "backdrop_path", "belongs_to_collection", "genres", "homepage", "id",
                                     "original_language", "original_title", "overview", "popularity", "poster_path", 
                                     "production_companies", "production_countries", "release_date", "runtime", 
                                     "spoken_languages", "status", "tagline", "title", "video", "vote_average", 
                                     "vote_count"])

In [24]:
tmdb_data["imdb_id"].duplicated().value_counts()

False    2570
True        1
Name: imdb_id, dtype: int64

In [25]:
tmdb_data["imdb_id"] = tmdb_data["imdb_id"].drop_duplicates()
tmdb_data["imdb_id"].duplicated().value_counts()

False    2571
Name: imdb_id, dtype: int64

In [26]:
tmdb_data["imdb_id"].isna().value_counts()

False    2570
True        1
Name: imdb_id, dtype: int64

In [27]:
tmdb_data["imdb_id"] = tmdb_data["imdb_id"].fillna('')
tmdb_data["imdb_id"].isna().value_counts()

False    2571
Name: imdb_id, dtype: int64

In [28]:
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
title_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_tmdb = {
    "imdb_id": String(key_len+1), 
    "revenue":Float(),
    "budget":Float(),
    "certification":Text(title_len+1)}

In [29]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine,dtype=df_tmdb, if_exists='replace',index=False)

engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [30]:
h = """SELECT t.imdb_id, t.revenue, t.budget, t.certification 
FROM tmdb_data as t
LIMIT 5"""
pd.read_sql(h,engine)

     imdb_id     revenue      budget certification
0                    NaN         NaN          None
1          0         NaN         NaN          None
2  tt0035423  76019000.0  48000000.0         PG-13
3  tt0113026         0.0  10000000.0          None
4  tt0113092         0.0         0.0          None

# Genres

In [37]:
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                       'genre_id': genre_map.values()})

In [32]:
title_len = genres['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_genre = {'genre_id': Integer(),
    "genre_name":Text(title_len+1)}

In [33]:
## Set the dataframe index and use index=True 
genres.set_index('genre_id').to_sql('genres',engine,index=True, if_exists='replace')

26

In [34]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [35]:
#SQLalchemy
i = """SELECT g.genre_id, genre_name
FROM genres as g
LIMIT 5"""
pd.read_sql(i,engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

# Tables

In [36]:
q = """SHOW tables"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2      title_genre
3    title_ratings
4        tmdb_data